astb_relise/src/InformationRegisters/ПараметрыПодключенияКСервисуДляПроверкиКодовМаркировки/ПараметрыПодключенияКСервисуДляПроверкиКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПодключенияКСервисуДляПроверкиКодовМаркировки</name>
  <resources>
    <name>Источник</name>
    <type>
      <types>EnumRef.ИсточникиДляПроверкиКодовМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ИсточникиДляПроверкиКодовМаркировки/ИсточникиДляПроверкиКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиДляПроверкиКодовМаркировки</name>
  <enumValues>
    <name>SAPВостокСервис</name>
  </enumValues>
  <enumValues>
    <name>ЕИСФ</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/InformationRegisters/ПараметрыПодключенияКСервисуДляПроверкиКодовМаркировки/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию()
	
	Если Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.SAPВостокСервис") Тогда
		
		Запись.Адрес = "http://af3i4.vostok.service:8000/sap/bc/srt/wsdl/bndg_D1383D5E713EE47BE1000000C0A80AE4/wsdl11/service/standard/rpc?sap-client=300";
		
	ИначеЕсли  Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.ЕИСФ") Тогда
		
		Запись.Адрес = "astb.vostok.ru/serial_num_base/hs/KM_OUT";
		
	Иначе
		
		Запись.Адрес = "";
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	СообщениеПользователю = Новый СообщениеПользователю;
	
	Если Запись.Источник = ПредопределенноеЗначение("Перечисление.ИсточникиДляПроверкиКодовМаркировки.SAPВостокСервис") Тогда
		
		ПараметрыСервиса = Новый Структура("Адрес,Пользователь,Пароль", Запись.Адрес, Запись.Пользователь, Запись.Пароль);
		ОписаниеОшибки = "";
		ПолучитьПроксиНаСервере(ОписаниеОшибки,ПараметрыСервиса);
		
		Если ОписаниеОшибки = "" Тогда
			СообщениеПользователю.Текст = "Подключение выполнено.";
		Иначе
			СообщениеПользователю.Текст = ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		
		HTTPСоединение = Новый HTTPСоединение(Запись.Адрес,,Запись.Пользователь,Запись.Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),Ложь);
		
		МассивДляЗапроса = Новый Массив;
		МассивДляЗапроса.Добавить(Новый Структура("КодМаркировки","123"));
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,МассивДляЗапроса);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Запрос = Новый HTTPЗапрос;
		Запрос.АдресРесурса = "/Enable_KM";
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8);
		
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(Запрос);
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			
			СообщениеПользователю.Текст = "Подключение выполнено.";
			
		Иначе
			
			СообщениеПользователю.Текст = "Ошибка подключения к HTTP-сервису!";
			
		КонецЕсли;
		
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПроксиНаСервере(ОписаниеОшибки,ПараметрыСервиса)
	
	Прокcи = ПроцедурыРаботыСНормамиСервер.ПолучитьWSПроксиДляПроверкиКодаМаркировки(ОписаниеОшибки,ПараметрыСервиса);
	
КонецПроцедуры
